Revit 2027 API
ParameterTypeId.MaterialAssetParamCommonSharedAsset Property
 "Sharing"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId MaterialAssetParamCommonSharedAsset { get; }
Public Shared ReadOnly Property MaterialAssetParamCommonSharedAsset As ForgeTypeId
	Get
public:
static property ForgeTypeId^ MaterialAssetParamCommonSharedAsset {
	ForgeTypeId^ get ();
}
static member MaterialAssetParamCommonSharedAsset : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace